

include("src/src/HRESDesign.jl")
include("src/pre-run.jl")
include("src/funcAPIs.jl")


paras = Dict("inputdata"=> Dict(
                           "光伏参数"=> Dict(
                                                    "装机容量（千瓦）"=> 500000,
                                                            "综合效率"=> 1,
                                                      "产品寿命（年）"=> 20,
                                                   "投资成本（￥/kW）"=> 3800,
                                                   "运维成本（￥/kW）"=> 190,
                                                   "替换成本（￥/kW）"=> 3800,
                                                  "单位设备容量（kW）"=> 650
                                       ),
                           "风电参数"=> Dict(
                                                    "装机容量（千瓦）"=> 500000,
                                                            "综合效率"=> 1,
                                                      "产品寿命（年）"=> 20,
                                                   "投资成本（￥/kW）"=> 3800,
                                                   "运维成本（￥/kW）"=> 190,
                                                   "替换成本（￥/kW）"=> 3800,
                                                  "单位设备容量（kW）"=> 650
                                       ),
                         "电解槽参数"=> Dict(
                                                    "装机容量（千瓦）"=> 500000,
                                                            "综合效率"=> 1,
                                                      "产品寿命（年）"=> 20,
                                                   "投资成本（￥/kW）"=> 3800,
                                                   "运维成本（￥/kW）"=> 190,
                                                   "替换成本（￥/kW）"=> 3800,
                                                  "单位设备容量（kW）"=> 650
                                       ),
                           "储氢参数"=> Dict(
                                                       "装机容量（吨）"=> 15000,
                                                             "充能阈值"=> 0.9,
                                                       "产品寿命（年）"=> 20,
                                                    "投资成本（￥/吨）"=> 3800,
                                                    "运维成本（￥/吨）"=> 190,
                                                    "替换成本（￥/吨）"=> 3800,
                                                   "单位设备容量（吨）"=> 650
                                       ),
                           "储能参数"=> Dict(
                                                   "装机容量（千瓦时）"=> 15000,
                                                             "充能阈值"=> 0.9,
                                                       "产品寿命（年）"=> 20,
                                                    "投资成本（￥/kW）"=> 1500,
                                                    "运维成本（￥/kW）"=> 190,
                                                    "替换成本（￥/kW）"=> 1500,
                                                   "单位设备容量（kW）"=> 650
                                       ),
                         "经济性参数"=> Dict(
                                                         "系统运营年限（年）"=> 20,
                                                        "电解水成本（￥/kg）"=> 0.021,
                                                         "买电电价（￥/kwh）"=> 0.355,
                                                         "卖电电价（￥/kwh）"=> 0.228,
                                                      "氢气售卖价格（￥/kg）"=> 25.58,
                                                                 "目标收益率"=> 0.05,
                                                                   "综合税率"=> 0,
                                                                     "折旧率"=> 0.05,
                                                   "煤电碳排放因子（kg/kWh）"=> 1,
                                                   "气电碳排放因子（kg/kWh）"=> 0.5
                                       ),
                           "优化时长"=> 1
                 ),
         "mode"=> 3,
        "isopt"=> [
          0,
          0,
          1,
          0,
          1]
 )



sol, table = optimization(paras["inputdata"], Vector{Int}(paras["isopt"]), Val(paras["mode"]))
  # 返回数据，匹配前端request要求的格式
  
  Dict(
    "code" => 200,
    "message" => "success",
    "data" => Dict(
      "table" => getTableData(table),
      "figure" => Dict(
        "xAxis" => collect(1:8760),
        "yAxis" => getFigureData(sol, Val(paras["mode"]))
      )
    ))
    
